Documents/ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаявленияОПредоставленииСведенийОТрудовойДеятельности</Name>
			<Comment>АПК:93 Представления объекта и списка совпадают с синонимом</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗаявленияОВеденииТрудовыхКнижек</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаявления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗаявлениеОтозвано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗаявленияОВеденииТрудовыхКнижек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявленияОВеденииТрудовыхКнижек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заявление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗаявления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедениеБумажнойТрудовойКнижки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОТрудовойДеятельностиВЭлектроннойФорме</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявленияОПредоставленииСведенийОТрудовойДеятельности/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УникальныеСотрудники = Новый Соответствие;
	ЗаявленияСотрудников = ЭлектронныеТрудовыеКнижки.ЗаявленияСотрудниковОВеденииТрудовыхКнижек(
		Истина, Организация, Дата, Сотрудники.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник"), Ссылка);
	
	Для Каждого ДанныеСотрудника Из Сотрудники Цикл 
		
		Если ЗначениеЗаполнено(ДанныеСотрудника.Сотрудник) Тогда
			
			Если УникальныеСотрудники[ДанныеСотрудника.Сотрудник] <> Неопределено Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Строка %1: Сотрудник %2 уже был введен ранее в строке %3.'"),
					ДанныеСотрудника.НомерСтроки, ДанныеСотрудника.Сотрудник, УникальныеСотрудники[ДанныеСотрудника.Сотрудник]);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
					"Объект.Сотрудники[" + Формат(ДанныеСотрудника.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].Сотрудник" , , Отказ);
				
			Иначе
				УникальныеСотрудники.Вставить(ДанныеСотрудника.Сотрудник, ДанныеСотрудника.НомерСтроки);
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ФизическоеЛицо", ДанныеСотрудника.Сотрудник);
		СтруктураПоиска.Вставить("ВидЗаявления", Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СведенияОТрудовойДеятельностиВЭлектроннойФорме);
		
		ЗаявленияНаВедениеВЭлектроннойФорме = ЗаявленияСотрудников.НайтиСтроки(СтруктураПоиска);
		Если ЗаявленияНаВедениеВЭлектроннойФорме.Количество() > 0 Тогда
			
			ЗаявлениеНаВедениеВЭлектроннойФорме = ЗаявленияНаВедениеВЭлектроннойФорме[0];
			ДатаЗаявленияНаВедениеВЭлектроннойФорме = ЗаявлениеНаВедениеВЭлектроннойФорме.ПериодЗаписи;
			ЗаявленияНаВедениеВЭлектроннойФормеДействует = Не ЗаявлениеНаВедениеВЭлектроннойФорме.Отозвано;
			РегистраторЗаявленияНаВедениеВЭлектроннойФорме = ЗаявлениеНаВедениеВЭлектроннойФорме.Регистратор;
			
		Иначе
			
			ДатаЗаявленияНаВедениеВЭлектроннойФорме = '00010101';
			ЗаявленияНаВедениеВЭлектроннойФормеДействует = Ложь;
			РегистраторЗаявленияНаВедениеВЭлектроннойФорме = Неопределено;
			
		КонецЕсли;
		
		Если ДанныеСотрудника.ВидЗаявления = Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СведенияОТрудовойДеятельностиВЭлектроннойФорме Тогда
			
			Если ЗаявленияНаВедениеВЭлектроннойФормеДействует Тогда
				
				Если ДанныеСотрудника.ВидЗаявления = Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СведенияОТрудовойДеятельностиВЭлектроннойФорме Тогда
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Строка %1: Сотруднику %2 уже оформлено заявление на предоставление сведений о трудовой деятельности в электронной форме в документе %3.'"),
						ДанныеСотрудника.НомерСтроки, ДанныеСотрудника.Сотрудник, РегистраторЗаявленияНаВедениеВЭлектроннойФорме);
					
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РегистраторЗаявленияНаВедениеВЭлектроннойФорме, , , Отказ);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			СтруктураПоиска.Вставить("ВидЗаявления", Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.ВедениеБумажнойТрудовойКнижки);
			ЗаявленияНаВедениеВБумажнойФорме = ЗаявленияСотрудников.НайтиСтроки(СтруктураПоиска);
			
			Если ЗаявленияНаВедениеВБумажнойФорме.Количество() > 0 Тогда
				
				ЗаявлениеНаВедениеВБумажнойФорме = ЗаявленияНаВедениеВБумажнойФорме[0];
				ДатаЗаявленияНаВедениеВБумажнойФорме = ЗаявлениеНаВедениеВБумажнойФорме.ПериодЗаписи;
				ЗаявлениеНаВедениеВБумажнойФормеДействует = Не ЗаявлениеНаВедениеВБумажнойФорме.Отозвано;
				РегистраторЗаявленияНаВедениеВБумажнойФорме = ЗаявлениеНаВедениеВБумажнойФорме.Регистратор;
				
			Иначе
				
				ДатаЗаявленияНаВедениеВБумажнойФорме = '00010101';
				ЗаявлениеНаВедениеВБумажнойФормеДействует = Ложь;
				РегистраторЗаявленияНаВедениеВБумажнойФорме = Неопределено;
				
			КонецЕсли;
			
			Если ЗаявленияНаВедениеВЭлектроннойФормеДействует Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Строка %1: Сотруднику %2 перед оформлением заявления на ведение бумажной трудовой книжки необходимо отозвать заявление на предоставление сведений о трудовой деятельности в электронной форме %3.'"),
					ДанныеСотрудника.НомерСтроки, ДанныеСотрудника.Сотрудник, РегистраторЗаявленияНаВедениеВЭлектроннойФорме);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РегистраторЗаявленияНаВедениеВЭлектроннойФорме, , , Отказ);
				
			ИначеЕсли ЗаявлениеНаВедениеВБумажнойФормеДействует Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Строка %1: Сотруднику %2 уже оформлено заявление на ведение бумажной трудовой книжки в документе %3.'"),
					ДанныеСотрудника.НомерСтроки, ДанныеСотрудника.Сотрудник, РегистраторЗаявленияНаВедениеВБумажнойФорме);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РегистраторЗаявленияНаВедениеВБумажнойФорме, , , Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.ДанныеДляПроведенияДокумента(Ссылка);
	ЭлектронныеТрудовыеКнижки.СформироватьДвиженияЗаявленийОВеденииТрудовыхКнижек(
		Движения.ЗаявленияОВеденииТрудовыхКнижек, ДанныеДляПроведения.ЗаявленияОВеденииТрудовыхКнижек);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
